Revit 2027 API
Dimension.ResetTextPosition Method
 Resets the text position of the dimension to the initial position determined by its type and parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetTextPosition()
Public Sub ResetTextPosition
public:
void ResetTextPosition()
member ResetTextPosition : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when:
SpotDimension has more than one segments.
Remarks
 The initial point is the text position determined by the type and parameters of the dimension. This property is for use with single-segment dimensions only. For multi-segment dimensions use the corresponding method of the DimensionSegment class.
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace